package firstJava;

public class Modifier {

	public static void main(String[] args) {
		
/*
	   < 제어자 >	
	   class를 정의 할 때 제약,기능을 추가적으로 정의한다.
	   class, 변수, 메서드 앞에서 쓰이며 추가적인 조건과 기능을 부여함.  
	   
	     1. 제약, 조건을 추가
	     2. 정보은닉  : 변수의 데이터에 접근하지 못하도록 제어, 정보 보호 -> 캡슐화 
		 
		 
		* 접근 제어 지시 (visibility)		
		사용되는 곳 : 클래스(인스턴스 생성 제어), 멤버변수(참조 제어), 메서드(호출 제어), 생성자(인스턴스 생성 제어)
		★public -> 누구나 접근 가능 
		protected -> 같은 패지키, 다른 패키지의 자손 클래스 접근 가능
		(default) -> 같은 패키지 내에서만 접근 가능
		★private  -> 같은 클래스 내에서만 접근 가능
		 
		* 제어자
		 static -> 전체 클래스에서 쓰이는 고정된 형식
		 final + 클래스 : 변경X, 확장될 수 없는 클래스
		       + 메서드 : 변경X, 오버라이딩X
		       + 변 수   : 값을 변경할 수 없는 상수
		 abstract -> 미완성의, 추상의
		                             클래스와 메서드에 사용
		 
		 
		 * 정보은닉 -> 접근제어 지시자 사용
		 
		 싱글톤패턴 -> 객체가 여러개 생성되는것을 막고 하나만 생성하도록 할때
		 
		
		 
		  
		  
*/
		
		
		
		
		
	}

}
